# thesis-template-in-org-mode -*- mode: org; coding: utf-8; -*-
# --------------------------------------------------------------------------------------------------
# FOR HTML
# --------
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

# FOR PDF / LaTeX
# ---------------
#+LATEX_CLASS: koma-book
#+LATEX_CLASS_OPTIONS: [a4paper, fontsize=11pt, BCOR=8mm, DIV=11]
#+LATEX_HEADER: \input{preamble}
#+STARTUP: latexpreview

# GENERAL
# -------
#
#   set toc and title to :t for html export ...
#
#+OPTIONS: toc:nil tex:t num:t title:nil
# tex:verbatim
#+CATEGORY: thesis
#+KEYWORDS: inf cs thesis org latex pdf html template
#+LANGUAGE: en-GB
#+EXPORT_FILE_NAME: thesis-template-in-org-mode
# +SELECT_TAGS: export
# +EXCLUDE_TAGS: todo
# +LATEX_HEADER: \renewcommand\maketitle{}
# --------------------------------------------------------------------------------------------------
#+TITLE: Thesis template in ~org-mode~
#+SUBTITLE: convertable to ~html~, ~tex~ and ~pdf~
#+DATE: Mi 3. Jan CET 2024
#+AUTHOR: Felix Drees
#+EMAIL: name@domain.abcdefg
# --------------------------------------------------------------------------------------------------

#+LATEX: \input{titlepage}

#+TOC: headlines
#+TOC: listings
#+TOC: tables

#+latex: \clearpage

#+begin_abstract
this is the section where i will put my english abstract ...
#+end_abstract

#+begin_export latex
\selectlanguage{ngerman}
\begin{abstract}
Hier die deutsche zusammenfassung ...
\end{abstract}
\selectlanguage{british}
#+end_export


* nix shell (env)

#+name: nix-config-cat
#+attr_latex: :options frame=single :wrap src text
#+caption: ~nix-shell~ config for generating a build environment
#+begin_src shell :results output pp :exports both
cat shell.nix
#+end_src

#+RESULTS: nix-config-cat
#+begin_example
{ pkgs ? import <nixpkgs> {} }:

pkgs.mkShell {
  buildInputs = with pkgs; [
    (python310.withPackages(ps: with ps; [ numpy latexify-py scipy pygments ]))
    graphviz
  ];

  shellHook = ''
    echo "entering dev environment"
  '';
}
#+end_example


** packages

#+name: emacsPackageList
#+begin_src shell :results output :exports results
cat ~/.config/doom/packages.el | grep "^(package"
#+end_src

#+RESULTS: emacsPackageList
: (package! evil-tutor)
: (package! pdf-tools)
: (package! org-special-block-extras) ;; (use-package org-special-block-extras :ensure t)


* convert python 2 latex

#+name: py2texImports
#+attr_latex: :options frame=single :wrap src text
#+begin_src python :session main :exports code :results none :wrap src text
import math
import numpy as np
import scipy
import latexify
#+end_src


#+name: py2texImportTable
#+begin_src python :results table :session main :exports results :hlines yes :colnames yes
[line.split("=") for line in
 f"{latexify.__version__ = }\n{np.__version__ = }\n{scipy.__version__ = }".split("\n")]
#+end_src

#+CAPTION: table of libararys with coresponding version
#+RESULTS: py2texImportTable
| latexify.__version__ | '0.0.0a0' |
| np.__version__       | '1.24.2'  |
| scipy.__version__    | '1.10.1'  |


With the imported libs, we can now convert a ~python~ function to ~latex~


#+name: isPrimeFunc
#+attr_latex: :options frame=single :wrap src text
#+caption: code block containing prime checking functions
#+begin_src python -n -r :results output :session main :exports code
def recHelper(x: int, d: int = 3) -> int:      (ref:recHelperRef)
    # forall x in [3, infty)
    if x % 2 == 0:
        return 0
    elif d > math.floor(math.sqrt(x)):
        return 1
    elif x % d == 0:
        return 0
    else:
        return recHelper(x, d + 2)

def isPrime(x: int) -> int:                    (ref:isPrimeRef)
    if x <= 1:  # forall x in (infty, 1] : 1
        return 0
    elif x == 2:
        return 1
    else:  # forall x in (2, infty)
        return recHelper(x, 3)
#+end_src

#+RESULTS: isPrimeFunc

In line [[(isPrimeRef)]] we remember the current position.
[[(recHelperRef)][Line (recHelperRef)]] jumps to point-min.


#+name: genLatexForPrimeFunc
#+begin_src python :results output drawer :session main :exports results
print(f"\\[ {latexify.get_latex(isPrime)} \\]\n" \
      f"\\\\\n\\[ {latexify.get_latex(recHelper)} \\]")
#+end_src

#+RESULTS: genLatexForPrimeFunc
:results:
\[ \mathrm{isPrime}(x) = \left\{ \begin{array}{ll} {0}, & \mathrm{if} \ {x \le {1}} \\ {1}, & \mathrm{if} \ {x = {2}} \\ \mathrm{recHelper}\left(x, {3}\right), & \mathrm{otherwise} \end{array} \right. \]
\\
\[ \mathrm{recHelper}(x, d) = \left\{ \begin{array}{ll} {0}, & \mathrm{if} \ {x \mathbin{\%} {2} = {0}} \\ {1}, & \mathrm{if} \ {d > \left\lfloor{\sqrt{x}}\right\rfloor} \\ {0}, & \mathrm{if} \ {x \mathbin{\%} d = {0}} \\ \mathrm{recHelper}\left(x, d + {2}\right), & \mathrm{otherwise} \end{array} \right. \]
:end:


#+name: checkIfPrime
#+begin_src python :session main :exports none :output none :var x=5
bool(isPrime(x))
#+end_src

#+RESULTS: checkIfPrime
: True


Now we can call the ~isPrime~ function with the parameter ~5~ and ~6~:

 - is ~5~ a prime number? result of ~isPrime~ func: call_checkIfPrime(x=5) {{{results(=True=)}}}
 - is ~6~ a prime number? result of ~isPrime~ func: call_checkIfPrime(x=6) {{{results(=False=)}}}


